---
kind: method
id: M:Autodesk.Revit.DB.ScheduleHeightsOnSheet.Dispose
source: html/d99c078f-8c99-93e8-6759-286e021b250d.htm
---
# Autodesk.Revit.DB.ScheduleHeightsOnSheet.Dispose Method

Releases all resources used by the ScheduleHeightsOnSheet

## Syntax (C#)
```csharp
public void Dispose()
```